/**************************************************************/
//冒泡排序：每一轮从第1个数开始依次比较相邻的两个数，将较大的数移至右边，一轮结束时，最大的数被排到最右端。
//下一轮则对剩余数进行同样操作。
/**************************************************************/
#include <stdio.h>

int main() 
{
	const int N = 10;
	int a[N];

	for (int i = 0; i < N; i++) {
		scanf("%d", &a[i]);
	}
		
	for (int i = 1; i <= N - 1; i++) //共N-1轮
	{
		//第i轮时a[0]到a[N-i-1]都与下一元素比较
		for (int j = 0; j < N - i  ; j++)
		{
			if (a[j] > a[j + 1])
			{
				int temp = a[j];
				a[j] = a[j + 1];
				a[j + 1] = temp;
			}
		}
	}

	for (int i = 0; i < N; i++) {
		printf("%d ", a[i]);
	}
}
