//1~5公里的单价是2.4元,1~8公里的单价是2.25元,8公里以后的单价是2.4元
//故可把行程分以8公里分割,分割结束的剩余行程以5公里为基准点选择是否需要重新叫车

#include <stdio.h>

int main() {
    int n;  //公里数
    while (scanf("%d", &n), n != 0) {
        double cost;   //最小花费
        if (n <= 4) {  //若行程小于等于4公里,则收起步价10元
            cost = 10;
        } else if (n <= 8) {  //若行程是4~8公里
            cost = 10 + (n - 4) * 2;
        }
        //若行程大于等于8公里,则按8公里分割
        else {
            int mod = n % 8;  //分割结束最后剩余的公里数
            if (mod <= 5) {  //若剩余公里数小于等于5,就可按2.4元的单价继续行驶
                cost = (n / 8) * (8 * 2.25) + (mod * 2.4);
            } else {  //若剩余公里数大于5,就选择重新叫车
                cost = (n / 8) * (8 * 2.25) + (10 + (mod - 4) * 2);
            }
        }
        //输出：有非零小数保留一位,无非零小数输出不带小数点的整数
        if (cost - (int)cost == 0)  printf("%d\n", (int)cost);
        else  printf("%.1lf\n", cost);
    }
    return 0;
}
